{
  "slides": [
    {
      "id": 0,
      "title": "trusted industry leader",
      "tagline": "خدمات بهره برداری از خطوط تولید کارخانه های صنعتی و معدنی",
      "image": "/images/slide1.jpg",
      "buttons": [
        {
          "id": 0,
          "text": "Roberto Nickson",
          "link": "https://www.pexels.com/@rpnickson/",
          "type": "btn-dark btn-circle"
        }
      ]
    },
    {
      "id": 1,
      "title": "Welcome to civilgroup",
      "tagline": "خدمات تامین و مدیریت نیروی انسانی مورد نیاز و مرتبط جهت بهره برداری",
      "image": "/images/slide2.jpg",
      "buttons": [
        {
          "id": 0,
          "text": "Julia M Cameron",
          "link": "https://www.pexels.com/@julia-m-cameron/",
          "type": "btn-dark btn-circle"
        }
      ]
    },
    {
      "id": 2,
      "title": "trusted industry leader",
      "tagline": "ارائه کلیه خدمات بازرگانی خارجی و داخلی، لجستیک و تشریفات گمرکی",
      "image": "/images/slide5.jpg",
      "buttons": [
        {
          "id": 0,
          "text": "Julia M Cameron",
          "link": "https://www.pexels.com/@julia-m-cameron/",
          "type": "btn-dark btn-circle"
        }
      ]
    },
    {
      "id": 3,
      "title": "Welcome to civilgroup",
      "tagline": "خدمات مهندسی، تامین و راه اندازی پروژه های صنعتی و معدنی",
      "image": "/images/slide4.jpg",
      "buttons": [
        {
          "id": 0,
          "text": "Julia M Cameron",
          "link": "https://www.pexels.com/@julia-m-cameron/",
          "type": "btn-dark btn-circle"
        }
      ]
    }
  ],

  "projects": [
    {
      "id": 0,
      "image": "ravar1.jpg",
      "title": "پروژه بهره برداری از واحد احیاء (کوره تونلی)، بریکت سازی و بوته های کاربیدی کارخانه راور فولاد کرمان",
      "overview": "بهره برداری کارخانه فولاد راور کرمان",
      "description": "پروژه بهره برداري از واحد بریکت، احیاء و بوته هاي \nکاربیدي کارخانه فولاد راور کرمان مشتمل بر انجـام \nو راهبـري عملیـات تولیـد، نگهـداري و تعمیـرات \nکارخانه، تامین قطعـات و مـواد مصـرفی(MRO)، \nانجام امور پشتیبانی تولید، اجراي نظام 5S، تامین و \nمدیریت نیروي انسانی مـورد نیـاز و ارائـه هرگونـه\nخدمات جانبی موردنیاز و مرتبط جهت بهره برداري \nاز کارخانه بریکت سـازي راور مشـتمل بـر خطـوط \nاحیـاء(سـالن متریـال هنـدلینگ، ایسـتگاه هـاي \nلودینگ و آنلودینگ، کوره هاي شماره 1 و 2، واگـن \nها و تجهیزات مرتبط)، خطوط بریکت سازي، سـالن \nتولیــد بوتــه هــاي کاربیــدي، کلیــه تاسیســات و \nتجهیزات صنعتی، ساختمان ها وتاسیسات آن هـا و \nسایر تاسیسات و تجهیزات مرتبط",
      "categories": ["بهره برداری", "خرید"],
      "employee": "شرکت کاوند نهان زمین",
      "startDate": "فروردین ماه ۱۴۰۱",
      "location": "راور کرمان",
      "images": [
        { "id": 0, "src": "ravar2.jpg" },
        { "id": 1, "src": "ravar3.jpg" },
        { "id": 2, "src": "ravar4.jpg" },
        { "id": 3, "src": "ravar5.jpg" },
        { "id": 4, "src": "ravar6.jpg" },
        { "id": 5, "src": "ravar7.jpg" },
        { "id": 6, "src": "ravar8.jpg" }
      ]
    },
    {
      "id": 1,
      "image": "golgohar1.jpg",
      "overview": "عملیات اجرایی کارخانه فولادسازی و نورد گرم گل گهر",
      "title": "پروژه انجام عملیات اجرایی کارخانه فولادسازی و نورد ورق گرم گل گهر",
      "description": "پروژه انجام عملیات اجرایی کارخانه فولادسازی و نورد گرم گل گهر شامل و نه محدود به اقدامات مربوط به کارهای فولادی با میلگرد قالب بندی، تهیه و اجرای بتن، عملیات خاکی و سایر عملیات مورد نیاز سایت در محدوده فهرست بهای واحد پایه رسته ساختمان و راه در پروژه احداث کارخانه فولادسازی و نورد گرم گل گهر می باشد. \nتجهیز کارگاه اعم از ماشین آلات سبک و سنگین و پچینگ پلانت، دستگاه سندبلاست و رنگ و خودروهای باری و سواری و تأمین و استقرار نیروی انسانی کافی و مجرب با مصالح و ابزار لازم در کلیه مراحل اجرا و انجام هرگونه خدمات با هدف نهایی تحقق بتن ریزی، قالب بندی، آرماتوربندی، عملیات خاکی و کلیه عملیات سیویل بر اساس نواحی مشخص شده در قرارداد پروژه فولادسازی با کارفرما و تهیه و تامین قطعات یدکی، سوخت روغن تجهیزات و ماشین آلات، کلیه مصالح مصرفی وغیرمصرفی  و تطبیق نقشه های اجرایی و ساختمانی با محل اجرا و پیاده سازی فرآیندهای کاری منظم و دستورالعمل های اجرایی و ایمنی مورد نیاز مطابق استانداردهای مربوطه به همراه استقرار افراد ایمنی با تجربه مطابق با دستورالعمل های شرکت توسعه آهن و فولاد گل گهر و شرکت فکور صنعت تهران\n\n",
      "categories": ["اجرا"],
      "employee": "شرکت مهندسی فکور صنعت تهران",
      "startDate": "مرداد ماه ۱۴۰۱",
      "location": "سیرجان",
      "images": [
        { "id": 0, "src": "gol5.jpg" },
        { "id": 1, "src": "gol4.jpg" },
        { "id": 2, "src": "gol2.jpg" },
        { "id": 3, "src": "gol6.jpg" }
      ]
    },

    {
      "id": 2,
      "image": "golgohar_2.jpg",
      "title": "پروژه نصب لوله هاي زیرزمینی پلی اتیلن کارخانه فولادسازي و نورد ورق گرم گل گهر",
      "overview": "نصب لوله های زیر زمینی کارخانه فولادسازی گل گهر",
      "description": "پروژه نصب لوله های زیرزمینی پلی اتیلن کارخانه  فولادسازی و نورد گرم گل گهر از مسیر ESP به MRSS در پروژه احداث کارخانه فولادسازی و نورد گرم گل گهر شامل عملیات خاک برداری و حفاری، خرید، حمل و اجرای ماسه بادی، خاک ریزی، بارگیری و تخلیه خاک اضافه تا محل دپو در 5 کیلومتری، داربست بندی ایمنی و نوارگذاری اطراف کانال، متریال هندلینگ، فیتاپ، ریسه کردن و تست خطوط می باشد.\nتجهیز کارگاه و تأمین و استقرار نیروی انسانی کافی و مجرب با مصالح و ابزار لازم در کلیه مراحل اجرا و انجام هرگونه خدمات در قرارداد پروژه فولادسازی با کارفرما و تهیه و تامین قطعات یدکی، سوخت روغن تجهیزات و ماشین آلات، کلیه مصالح مصرفی وغیرمصرفی  و تطبیق نقشه های اجرایی و ساختمانی با محل اجرا و پیاده سازی فرآیندهای کاری منظم و دستورالعمل های اجرایی و ایمنی مورد نیاز مطابق استانداردهای مربوطه به همراه استقرار افراد ایمنی با تجربه مطابق با دستورالعمل های شرکت توسعه آهن و فولاد گل گهر و شرکت فکور صنعت تهران\n\n\n",
      "categories": ["اجرا", "خرید", "نصب"],
      "employee": " شرکت مهندسی فکور صنعت تهران",
      "startDate": "آبان ماه ۱۴۰۱",
      "location": "سیرجان",
      "images": [
        { "id": 0, "src": "gol4.jpg" },
        { "id": 1, "src": "gol2.jpg" },
        { "id": 2, "src": "gol3.jpg" },
        { "id": 3, "src": "gol6.jpg" }
      ]
    },
    {
      "id": 3,
      "image": "gol1.jpg",
      "title": "پروژه انجام عملیات اجرایی کارخانه آهک فولادسازی و نورد گرم گل گهر",
      "overview": "عملیات اجرایی کارخانه آهک فولادسازی گل گهر",
      "description": "پروژه انجام عملیات اجرایی کارخانه آهک فولادسازی و نورد گرم گل گهر شامل و نه محدود به اقدامات مربوط به کارهای فولادی با میلگرد قالب بندی، تهیه و اجرای بتن، عملیات خاکی و سایر عملیات مورد نیاز سایت در محدوده فهرست بهای واحد پایه رسته ساختمان و راه در پروژه احداث کارخانه فولادسازی و نورد گرم گل گهر می باشد. \nتجهیز کارگاه اعم از ماشین آلات سبک و سنگین و پچینگ پلانت، دستگاه سندبلاست و رنگ و خودروهای باری و سواری و تأمین و استقرار نیروی انسانی کافی و مجرب با مصالح و ابزار لازم در کلیه مراحل اجرا و انجام هرگونه خدمات با هدف نهایی تحقق بتن ریزی، قالب بندی، آرماتوربندی، عملیات خاکی و کلیه عملیات سیویل بر اساس نواحی مشخص شده در قرارداد پروژه فولادسازی با کارفرما و تهیه و تامین قطعات یدکی، سوخت روغن تجهیزات و ماشین آلات، کلیه مصالح مصرفی وغیرمصرفی  و تطبیق نقشه های اجرایی و ساختمانی با محل اجرا و پیاده سازی فرآیندهای کاری منظم و دستورالعمل های اجرایی و ایمنی مورد نیاز مطابق استانداردهای مربوطه به همراه استقرار افراد ایمنی با تجربه مطابق با دستورالعمل های شرکت توسعه آهن و فولاد گل گهر و شرکت فکور صنعت تهران\n\n",
      "categories": ["خرید", "نصب", "اجرا"],
      "employee": " شرکت مهندسی فکور صنعت تهران",
      "startDate": "آذر ماه ۱۴۰۱",
      "location": "سیرجان",
      "images": [
        { "id": 0, "src": "gol2.jpg" },
        { "id": 1, "src": "gol4.jpg" },
        { "id": 2, "src": "gol5.jpg" },
        { "id": 3, "src": "gol6.jpg" }
      ]
    },
    {
      "id": 4,
      "image": "sangan1.jpg",
      "title": " پروژه خط انتقال آب از تصفیه خانه فاضلاب شهر تایباد تا ایستگاه پمپاژ ۱\nصنایع معدنی فولاد سنگان خراسان",
      "overview": "طراحی و اجرای فاز ۱ خط انتقال آب فولاد سنگان",
      "description": "شرکت صنایع معدنی فولاد سنگان خواف در شرق استان خراسان رضوی، در 18 کیلومتری شمال شرق شهر سنگان واقع شده است.  موضوع این پروژه انتقال پساب از تصفیه خانه فاضلاب شهر تایباد به ایستگاه پمپاژ شماره 1 با ظرفیت 450 لیتر بر ثانیه (مجموع دبی پساب تصفیه خانه فاضلاب تایباد و تریت جام) است. لازم بذکر است که طرح انتقال آب به مجتمع فولاد سنگان در دو فاز اجرا می شود که فاز 1 آن از ایستگاه پمپاژ شماره 1 تا سایت مخازن کارخانه (خارج از اسکپ این پیمان) و فاز 2 آن مربوط به انتقال آب از ایستگاه پمپاژ شماره صفر به سمت ایستگاه شماره 1 (پیمان حاضر) می باشد. موقعیت این طرح بین دو شهرستان تایباد و خواف خواهد بود. \n\nمسیر خط انتقال پساب فاضلاب تصفیه خانه شهر تایباد توسط ایستگاه پمپاژ شماره صفر که در محل تعیین شده توسط کارفرما در محدوده تصفیه خانه فاضلاب شهر تایباد جانمایی گردیده است با هد پمپاژ حدود 220 متر به سمت مخزن مکش ایستگاه پمپاژ شماره 1 توسط حدود 29 کیلومتر لوله فولادی به قطر 700 میلیمتر پمپاژ می گردد. \n",
      "categories": ["خرید", "نصب", "اجرا", "طراحی و مهندسی"],
      "employee": "شرکت فولاد سنگان",
      "startDate": "آبان ماه ۱۴۰۲",
      "location": "سنگان",
      "images": [
        { "id": 0, "src": "sangan2.jpg" },
        { "id": 1, "src": "sangan3.jpg" },
        { "id": 2, "src": "sangan4.jpg" },
        { "id": 3, "src": "sangan5.jpg" }
      ]
    },
    {
      "id": 5,
      "image": "sang_1.png",
      "title": " پروژه طراحی و اجراي خط انتقال آب از دشت کرات تایباد به\nمخازن فولاد سنگان خراسان",
      "overview": "طراحی و اجرای خط انتقال آب فولاد سنگان",
      "description": "شرکت صنایع معدنی فولاد سنگان خواف در شرق استان خراسان رضوی، در 18 کیلومتری شمال شرق شهر سنگان واقع شده است. موضوع این پروژه انتقال آب پساب استحصالی از دشت کرات تایباد به سایت شرکت صنایع معدنی فولاد سنگان خراسان با ظرفیت 560 لیتر بر ثانیه است.\n\nدر مسیر خط انتقال آب زیرزمینی دشت کرات شهرستان تایباد به سایت فولاد سنگان، آب استحصالی از چاه های شماره 3،5،6 با خط لوله 300،250 میلیمتری در محل مخزن مکش ایستگاه شماره 1 جمع آوری شده است و سپس به صورت پمپاژی (دو مرحله) از ایستگاه 1 از مسیر جنوبی با خط لوله 800 میلیمتری فولادی با پوشش داخلی و خارجی طبق مشخصات فنی به سمت ایستگاه پمپاژ شماره2 انتقال می یابد.از ایستگاه پمپاژ شماره 2 نیز آب به سمت مخازن تعادلی که در بالاترین نقطه مسیر جانمایی شده وارد و از آنجا نیز به صورت ثقلی به سمت مخازن کارخانه انتقال داده می شود.\n\nاجرای کامل طرح آبرسانی به شرکت صنایع معدنی فولاد سنگان از منابع آب زیرزمینی دشت کرات تایباد که شامل کلیه خدمات طراحی، مهندسی، تهیه، تامین، ساخت، خرید، اجرا، حمل، نصب، تست، راه اندازی و بهره برداری کامل تمامی بخش های مورد نیاز آبرسانی به ظرفیت حدود (560 لیتر بر ثانبه) شامل تاسیسات الکترومکانیکال،تجهیزات برق و ابزار دقیق و حفاظت کاتدیک، مخازن ذخیره و تعادلی، واحدهای ساختمانی و جنبی، ابنیه های فنی و محوطه سازی های، مشخصات فنی به روش طرح، ساخت و بهره برداری است.\n",
      "categories": ["طراحی و مهندسی", "اجرا", "خرید"],
      "employee": "شرکت ژیوار توسعه کرد",
      "startDate": "دی ماه ۱۴۰۱",
      "location": "سنگان",
      "images": [
        { "id": 0, "src": "sang_2.jpg" },
        { "id": 1, "src": "sang_3.png" },
        { "id": 2, "src": "sang_4.jpg" },
        { "id": 3, "src": "sang_5.png" }
      ]
    },
    {
      "id": 6,
      "image": "sang1.png",
      "title": "پروژه خرید اقلام خط انتقال آب از دشت کرات تایباد به\nمخازن فولاد سنگان خراسان",
      "overview": "خرید اقلام خط انتقال آب فولاد سنگان",
      "description": "خرید اقلام پروژه خدمات طراحی، تامین، ساخت و\nاجراي خط انتقال آب از دشت کرات تایباد به مخازن\nفولاد سنگان",
      "categories": ["خرید"],
      "employee": "شرکت ژیوار توسعه کرد",
      "startDate": "دی ماه ۱۴۰۱",
      "location": "سنگان",
      "images": [
        { "id": 0, "src": "sang2.png" },
        { "id": 1, "src": "sang3.jpg" },
        { "id": 2, "src": "sang4.jpg" },
        { "id": 3, "src": "sang5.jpg" }
      ]
    },
    {
      "id": 7,
      "image": "qas1.jpg",
      "title": "پروژه بهره‌برداری کارخانه کاتد مس بورلی قزاقستان به روش لیچینگ\n (با ظرفیت 5000 تن در سال)\n\n\n\n",
      "overview": "بهره برداری کارخانه کاتد مس بورلی قزاقستان",
      "description": "پروژه بهره‌برداری کارخانه کاتد مس بورلی به روش لیچینگ با ظرفیت 5000 تن در سال مشتمل بر عملیات تولید، نگهداری و تعمیرات کارخانه، تامین قطعات و مواد مصرفی، انجام امور پشتیبانی تولید، تامین و مدیریت نیروی انسانی مورد نیاز و مرتبط جهت بهره‌برداری از کارخانه شامل بخش‌های هیپ، پمپ‌خانه، SX و EW و بویلر می‌باشد",
      "categories": ["بهره برداری"],
      "employee": "شرکت ایرکز متال",
      "startDate": "ماه می ۲۰۲۳",
      "location": "قزاقستان",
      "images": [
        { "id": 0, "src": "qas2.jpg" },
        { "id": 1, "src": "qas3.jpg" },
        { "id": 2, "src": "qas4.jpg" },
        { "id": 3, "src": "qas5.jpg" }
      ]
    }
  ],
  "services": [
    {
      "id": 0,
      "image": "golgohar1.jpg",
      "slug": "commerce",
      "title": "بازرگانی و تامین اقلام پروژه",
      "overview": "",
      "description": "",
      "images": [
        { "id": 0, "src": "sangan2.jpg" },
        { "id": 1, "src": "sangan3.jpg" },
        { "id": 2, "src": "sangan4.jpg" },
        { "id": 3, "src": "sangan5.jpg" }
      ]
    },
    {
      "id": 1,
      "image": "golgohar_2.jpg",
      "slug": "operation",
      "title": "بهره برداری پروژه های صنعتی و معدنی",
      "overview": "",
      "description": "شرکت ژیوار صنعت کیان با سرمایه‌گذاری در حوزه آموزش و توسعه منابع انسانی و حفظ نیروهای انسانی و با تکیه بر آنها، در حوزه‌های تکمیل مرحله ساخت، پیش راه‌اندازی و تست عملکرد در پروژه‌های صنعتی و معدنی تا مرحله بهره‌برداری و توسعه در کنار کارفرما مشغول به فعالیت می‌باشد. همچنین مدیران این شرکت بر اساس خط‌مشی کیفیت متعهد هستند تا سیستم مدیریت یکپارچه خود را بر اساس استانداردهای بین‌المللی سیستم مدیریت کیفیت ارتقا بخشند. این شرکت در حال حاضر یکی از شرکت‌های راه‌اندازی و بهره‌برداری صنعت فولاد و مس در کشور می‌باشد.",
      "images": [
        { "id": 0, "src": "sangan2.jpg" },
        { "id": 1, "src": "sangan3.jpg" },
        { "id": 2, "src": "sangan4.jpg" },
        { "id": 3, "src": "sangan5.jpg" }
      ]
    },
    {
      "id": 2,
      "image": "gol1.jpg",
      "slug": "management",
      "title": "مدیریت پروژه های صنعتی و معدنی",
      "overview": "",
      "description": "شرکت ژيوار صنعت کیان عملیات مربوط مهندسی،‌ تامین و راه‌اندازی پروژه‌هایی همچون انتقال آب از دشت کرات تایباد به فولاد سنگان، عملیات اجرایی کارخانه آهک و فولاد کارخانه فولادسازی گل گهر را از طریق واحد‌های طرح و برنامه، مهندسی، بازرگانی و مالی و پشتیبانی خود به انجام رسانده‌است. با این وجود گسترش پروژه‌های شرکت افزایش تقاضا در خصوص خدمات راه‌اندازی و بهره‌برداری، این شرکت را بر آن داشت تا در زمینه راه‌اندازی و بهره‌برداری از نیروهای متخصص خود استفاده نموده و مشغول به کار گردد.",
      "images": [
        { "id": 0, "src": "sangan2.jpg" },
        { "id": 1, "src": "sangan3.jpg" },
        { "id": 2, "src": "sangan4.jpg" },
        { "id": 3, "src": "sangan5.jpg" }
      ]
    }
  ]
}
