{
  "LocaleLayout": {
    "title": "Zhivar Sanat Kian",
    "default": "Zhivar Sanat Kian | Main page",
    "description": "Zhivar Sanat Kian - Implementation and Operation of Industrial and Mining Projects"
  },
  "Header": {
    "Address": {
      "title": "Address",
      "description": "Tehran, Vanak Square, Molla Sadra Street, Shad Street, Baghsara Alley, No. 13"
    },
    "Phone": {
      "title": "Phone"
    },
    "Email": {
      "title": "Email"
    }
  },
  "Menu": {
    "home": "Home",
    "services": "Services",
    "commerce": "Commerce & Project Supply",
    "operation": "Industrial & Mining Operations",
    "management": "Industrial & Mining Management",
    "certifications": "Certifications",
    "projects": "Projects",
    "tenders": "Tenders",
    "about": "About Us",
    "cooperation": "Join Us",
    "jobs": "Job Opportunities",
    "companyCooperation": "Company Cooperation",
    "contact": "Contact Us"
  },
  "Footer": {
    "Links": {
      "about": "About Us",
      "contact": "Contact Us",
      "projects": "Projects",
      "tenders": "Tenders",
      "jobs": "Job Opportunities"
    },
    "text": "Zhivar Sanat Kian's services cover a wide range of activities related to engineering services, equipment supply, installation and commissioning, and operation (maintenance, manpower supply and management, etc.) of industrial and mining projects.",
    "description": "© All rights reserved and owned by Zhivar Sanat Kian Company."
  },
  "ServicesSection": {
    "title": "Zhivar Sanat Kian Services",
    "description": "Zhivar Sanat Kian, comprised of a young, experienced, and technically skilled team, was established in 2021 with the goal of playing a greater role in the country's development. The company has made remarkable strides in asset preservation, safety, environmental friendliness, responsibility, business ethics, innovation, and excellence. Leveraging its valuable experience in executing industrial projects, it has sought synergy to attract and undertake national projects. Equipped for the execution of large-scale industrial and mining projects, pump stations, water transmission pipelines, and water, oil, and gas treatment facilities, the company aspires to contribute more effectively to the prosperity and development of its homeland."
  },
  "ProjectsSection": {
    "title": "Recent Projects",
    "description": "Given the nature of large-scale projects, the execution complexities are increasing, with complex data, control systems, and safety measures becoming crucial. Moreover, higher expectations in productivity, reliability, safety, and the dynamic environments in which projects are executed further challenge design and execution teams. Based on this, Zhivar Sanat Kian Company has relied on its knowledge and experience, focusing on performance planning and optimization with a 'systemic approach' to achieve its goals and ensure optimal project execution, a summary of which is presented here."
  },
  "About": {
    "title": "About Us",
    "default": "Zhivar Sanat Kian | About Us",
    "description": "About Zhivar Sanat Kian"
  },
  "Contact": {
    "title": "Contact Us",
    "default": "Zhivar Sanat Kian | Contact Us",
    "description": "Zhivar Sanat Kian Contact Information"
  },
  "Certifications": {
    "title": "Certifications",
    "default": "Zhivar Sanat Kian | Certifications",
    "description": "Zhivar Sanat Kian Certifications and Awards"
  },
  "Projects": {
    "title": "Projects",
    "default": "Zhivar Sanat Kian | Projects",
    "description": "Zhivar Sanat Kian Projects"
  },
  "Tenders": {
    "title": "Tenders",
    "default": "Zhivar Sanat Kian | Tenders",
    "description": "Zhivar Sanat Kian Tenders"
  },
  "Commerce": {
    "title": "Services | Trade and Project Supply Items",
    "default": "Services | Trade and Project Supply Items",
    "description": "Zhivar Sanat Kian, as an international organization, operates in the field of supply and services related to industrial and mining projects, with the aim of providing comprehensive and effective solutions to various industries. By leveraging technical knowledge, a specialized team, and an extensive network of suppliers and business partners worldwide, we meet the needs of our customers with the highest quality and in the shortest possible time."
  },
  "Management": {
    "title": "Services | Industrial and Mining Projects Management",
    "default": "Services | Industrial and Mining Projects Management",
    "description": "The expertise of Zhivar Sanat Kian lies in providing comprehensive project management services that help the client complete their projects on time, within the defined scope and budget, and with the desired quality. Our team is committed to delivering high-quality services tailored to the unique needs of the client, especially in EPC (Engineering, Procurement, and Construction) projects."
  },
  "Operation": {
    "title": "Services | Industrial and Mining Projects Operation",
    "default": "Services | Industrial and Mining Projects Operation",
    "description": "Zhivar Sanat Kian's services in the field of operation of industrial projects include two phases: trial operation and commercial operation."
  },
  "CompanyCooperation": {
    "title": "Company Cooperation",
    "default": "Zhivar Sanat Kian | Company Cooperation",
    "description": "Company Collaboration Request Form"
  },
  "Hiring": {
    "title": "Job Opportunities",
    "default": "Zhivar Sanat Kian | Job Opportunities",
    "description": "Zhivar Sanat Kian Job Opportunities"
  }
}
