{
  "LocaleLayout": {
    "title": "Zhivar Sanat Kian",
    "default": "Zhivar Sanat Kian | Main page",
    "description": "Zhivar Sanat Kian - Implementation and Operation of Industrial and Mining Projects"
  },
  "NotFound": {
    "metadata": {
      "title": "Zhivar Sanat Kian",
      "description": "Zhivar Sanat Kian - Implementation and operation of industrial and mining projects"
    },
    "error": "404",
    "message": "Page not found. Return to homepage to see other sections of the website.",
    "button": "Return to Homepage"
  },
  "Header": {
    "Address": {
      "title": "Address",
      "description": "Tehran, Vanak Square, Molla Sadra Street, Shad Street, Baghsara Alley, No. 13"
    },
    "Phone": {
      "title": "Phone"
    },
    "Email": {
      "title": "Email"
    }
  },
  "Menu": {
    "home": "Home",
    "services": "Services",
    "commerce": "Commerce & Project Supply",
    "operation": "Industrial & Mining Operations",
    "management": "Industrial & Mining Management",
    "certifications": "Certifications",
    "projects": "Projects",
    "tenders": "Tenders",
    "about": "About Us",
    "cooperation": "Join Us",
    "jobs": "Job Opportunities",
    "companyCooperation": "Company Cooperation",
    "contact": "Contact Us"
  },
  "Footer": {
    "Links": {
      "about": "About Us",
      "contact": "Contact Us",
      "projects": "Projects",
      "tenders": "Tenders",
      "jobs": "Job Opportunities"
    },
    "text": "Zhivar Sanat Kian's services cover a wide range of activities related to engineering services, equipment supply, installation and commissioning, and operation (maintenance, manpower supply and management, etc.) of industrial and mining projects.",
    "description": "© All rights reserved and owned by Zhivar Sanat Kian Company."
  },
  "ServicesSection": {
    "title": "Zhivar Sanat Kian Services",
    "description": "Zhivar Sanat Kian, comprised of a young, experienced, and technically skilled team, was established in 2021 with the goal of playing a greater role in the country's development. The company has made remarkable strides in asset preservation, safety, environmental friendliness, responsibility, business ethics, innovation, and excellence. Leveraging its valuable experience in executing industrial projects, it has sought synergy to attract and undertake national projects. Equipped for the execution of large-scale industrial and mining projects, pump stations, water transmission pipelines, and water, oil, and gas treatment facilities, the company aspires to contribute more effectively to the prosperity and development of its homeland."
  },
  "ProjectsSection": {
    "title": "Recent Projects",
    "description": "Given the nature of large-scale projects, the execution complexities are increasing, with complex data, control systems, and safety measures becoming crucial. Moreover, higher expectations in productivity, reliability, safety, and the dynamic environments in which projects are executed further challenge design and execution teams. Based on this, Zhivar Sanat Kian Company has relied on its knowledge and experience, focusing on performance planning and optimization with a 'systemic approach' to achieve its goals and ensure optimal project execution, a summary of which is presented here."
  },
  "ServicesAccordion": {
    "commerce": {
      "title": "Commerce & Project Supply",
      "desc": "In the complex world of trade, procurement is considered one of the most specialized areas of international trade. Zhiwar Sanat Kian, with experience and a brilliant track record in commercial affairs, is recognized by all economic actors as a prominent figure in the field of supply of goods and services, import, and export. The most important principles and needs in import and export include the provision of commercial and NIMA foreign exchange services, the process of domestic and foreign procurement, familiarity with the principles and techniques of domestic and international marketing, and transportation. All these processes are handled by Zhiwar Sanat Kian."
    },
    "operation": {
      "title": "Industrial & Mining Operations",
      "desc": "The management and execution of commissioning, maintenance, facilities, and equipment, as well as training programs in industrial and mining sectors and other related processes, are carried out by Zhiwar Sanat Kian."
    },
    "management": {
      "title": "Industrial & Mining Management",
      "desc": "The changing nature of industries and the increasing complexity of new projects have driven Iranian companies to improve their capabilities and adopt new, systematic approaches to ensure successful project execution. Moreover, the adoption of modern approaches in management, construction, pre-commissioning, and commissioning in industrial projects is imperative."
    }
  },

  "CommerceAccordion": {
    "first": {
      "title": "Project Procurement",
      "desc": "We specialize in the procurement of various equipment and supplies for industrial and mining projects. Our services include identifying project requirements, selecting reliable suppliers, and providing the best solutions to reduce costs and optimize the supply chain."
    },
    "second": {
      "title": "Procurement of Spare Parts and Consumables for Factories",
      "desc": "Given the importance of timely procurement of spare parts and consumables in reducing production line downtime, our company supplies these items with guaranteed quality from the best international suppliers."
    },
    "third": {
      "title": "Procurement and Ordering of Essential Factory Supplies",
      "desc": "We provide comprehensive services in the procurement of critical and strategic factory supplies, including machinery, specialized equipment, and raw materials. Our team identifies factory needs and facilitates and manages the ordering process."
    },
    "fourth": {
      "title": "Procurement Engineering and Ordering of Custom-Made Parts",
      "desc": "Leveraging our expertise and engineering knowledge, we provide specialized services in ordering and manufacturing custom-made parts based on required technical specifications. These services include design, material selection, production process supervision, and quality assurance of the parts."
    },
    "fifth": {
      "title": "Trading and Procurement of Raw Materials for Mining and Petrochemical Industries",
      "desc": "As a trusted supplier of raw materials for the mining and petrochemical industries, we specialize in the procurement and trading of these products. Our extensive network in global markets enables us to provide high-quality materials at competitive prices."
    },
    "sixth": {
      "title": "Logistics Services and International Transportation",
      "desc": "We provide comprehensive logistics and international transportation services. These services include shipment planning, document management, customs coordination, and optimized solutions to reduce transportation costs."
    },
    "seventh": {
      "title": "Planning and Preparation of the Work Breakdown Structure (WBS) for Orders and Supply Infrastructure",
      "desc": "Using modern management techniques, we develop and implement the Work Breakdown Structure (WBS) for orders and supply infrastructure in various projects. This process helps clarify the supply chain and enhance efficiency."
    },
    "eighth": {
      "title": "Provision and Implementation of the EPR Procurement Process",
      "desc": "In line with modernizing procurement processes, we design and implement ERP systems for supply chain management. These services include identifying requirements, selecting the right software, and overseeing the implementation stages"
    }
  },

  "OperationAccordion": {
    "first": {
      "title": "Human Resources",
      "desc": [
        "Providing experienced and trained human resources related to the type of activity and in sufficient numbers, in all job categories required for timely execution and completion of work",
        "Commitment to applying management, control and supervision over the correct performance of work, by qualified individuals",
        "Employing appropriate executive methods and observing the sequence of work",
        "Responding to complaints and implementing verdicts related to labor dispute resolution boards and other labor law obligations"
      ]
    },
    "second": {
      "title": "Planning and Coordination",
      "desc": [
        "Preparation and presentation of organization, implementation method, production and maintenance program",
        "Preparation and presentation of program, charts and tables of production work progress",
        "Performing necessary coordination with other contractors or executive groups related to the operation subject",
        "Completion and continuous presentation of production control and process documents (log sheets and production identification-tracking cards, etc.)"
      ]
    },
    "third": {
      "title": "Procurement of Materials, Tools, Facilities, Equipment and Machinery Outside Production Lines",
      "desc": [
        "Procurement of materials, tools, machinery, equipment, work tools, transportation, fuel (gasoline, diesel, gas, etc.) and generally everything needed for the implementation of the operation subject",
        "Providing transportation facilities, creating necessary facilities to provide suitable housing and food for employees, providing basic medical facilities, providing safety equipment and personal protection appropriate to the type of work",
        "Providing machinery with relevant approvals and control and supervision according to supervision and evaluation checklists",
        "Periodic service, maintenance and repair of machinery"
      ]
    },
    "fourth": {
      "title": "Maintenance and Repair of Production Lines",
      "desc": [
        "Performing maintenance and repair operations for all production units and systems",
        "Performing periodic and basic repairs based on the approved program and issued instructions",
        "Performing emergency repairs based on issued instructions",
        "Preparation of spare parts and consumables needed for operation"
      ]
    },
    "fifth": {
      "title": "Inspection and Quality Control of Work",
      "desc": [
        "Preparation, compilation and completion of equipment inspection forms",
        "Preparation, compilation and completion of equipment identification cards",
        "Preparation, compilation and completion of equipment maintenance and repair standards"
      ]
    },
    "sixth": {
      "title": "Protection and Care of Work",
      "desc": [
        "Preservation and maintenance of materials, equipment, production line machinery, lands, roads and facilities"
      ]
    },
    "seventh": {
      "title": "Work Insurance and Responsibilities",
      "desc": [
        "Preparation of necessary insurance policies to cover contractual obligations",
        "Full coverage of civil liability insurance including relevant clauses to cover any damage including accidents resulting in injury to employees and others who are somehow related to the work, suffer an accident or incident, as well as third party insurance, to cover bodily injury or death or damage to property, etc. as a result of contract execution.",
        "Insurance of machinery, equipment, vehicles and other facilities needed to perform the work"
      ]
    }
  },

  "ManagementAccordion": {
    "first": {
      "title": "Design and Engineering Services",
      "desc": [
        "The engineering department of Zhivar Sanat Kian Company is established to provide the necessary engineering and technology services for clients in all mining, industrial, and other sectors, from the preliminary stages to the final phases of operation.",
        "The company's engineering team consists of engineers, technical specialists, a research group, and executive support members, enabling clients to access key professionals who are committed to performing tasks efficiently and effectively.",
        "The company's design and engineering unit, relying on the knowledge and experience of its technical team and utilizing cutting-edge technologies, continuously strives to provide innovative and efficient solutions to meet its clients' needs across various industrial sectors. It plays a significant role in the development and advancement of the country's industry. With a creative and knowledge-driven approach, this unit is constantly seeking to improve and enhance its services, leaving no effort spared in achieving these goals.",
        "The company provides a full range of services, including economic evaluation, project development, project management, preliminary and detailed engineering, procurement services, contract management, construction supervision, commissioning, operational support, and training for its clients."
      ]
    },
    "second": {
      "title": "Equipment Procurement Services",
      "desc": [
        "Zhivar Sanat Kian Company's equipment procurement services include procurement management, sourcing industrial equipment and raw materials from reputable international suppliers, and overseeing equipment quality assurance.",
        "The company's equipment procurement unit, leveraging its expertise in equipment supply, procurement engineering, and full knowledge of international trade regulations and domestic laws, is responsible for sourcing high-quality industrial equipment and machinery required for projects from reputable domestic and international suppliers.",
        "In this regard, equipment for the domestic sections of projects is sourced from reputable local suppliers and manufacturers, while foreign equipment is procured from globally recognized and technologically advanced manufacturers in accordance with each project's specific requirements. It is worth mentioning that the entire procurement process—from contract signing to project site delivery, including supplier identification, negotiations, inspections, transportation, insurance, and customs clearance—is managed and supervised by this unit."
      ]
    },
    "third": {
      "title": "Construction and Execution Services",
      "desc": [
        "Zhivar Sanat Kian Company's construction and execution management includes overseeing execution projects, supervising industrial project implementation, cost and schedule control, and executing projects in compliance with international standards.",
        "The execution of projects, from land handover to operation, is carried out or managed by experienced execution teams consisting of skilled specialists and experts. These stages include site preparation, procurement of machinery, tools, and equipment, leveling, construction of access roads and temporary facilities, execution of civil works and permanent structures, installation of mechanical, electrical, control, and instrumentation equipment, as well as cold and hot commissioning, along with training of the client’s personnel."
      ]
    }
  },

  "About": {
    "title": "About Us",
    "default": "Zhivar Sanat Kian | About Us",
    "description": "About Zhivar Sanat Kian",
    "companyName": "Zhivar Sanat Kian",
    "sections": {
      "about": {
        "title": "About the Company",
        "content": "Zhivar Sanat Kian Company, consisting of a young, experienced team with technical knowledge, was established in 2021 with the aim of playing a more important role in the country's development. The company has been able to take impressive steps towards preserving customer assets, safety and environmental friendliness, responsibility, business ethics, innovation and excellence, and relying on its valuable experiences in implementing industrial projects and in order to attract and implement national projects, it has taken synergistic action and equipped itself for the implementation of large industrial and mining projects, pumping stations and water transmission pipelines, water treatment plant facilities, oil and gas, and hopes to play a greater and more effective role in the development of their dear homeland."
      },
      "ceoMessage": {
        "title": "CEO's Message",
        "content": "Since the establishment of Zhivar Sanat Kian Company, by recruiting experienced managers familiar with production and operation complexes in various specialties, it has taken firm steps with extraordinary technical and specialized support to take over production line operations. Relying on the ability and expertise of executive, staff, commercial and support and welfare forces, it has been able to integrate warehouses and orders, commercial affairs, human resources, maintenance, part manufacturing, technical offices and with proper and timely supply and purchase of parts and equipment needed for production lines, to collect a complete information bank of suppliers, manufacturers and sellers of these parts. Zhivar Sanat Kian Company, based on the overlap of these talents and existing facilities, is able to provide all or a large part of the services expected by customers and manages large projects with the lowest cost and highest quality in every respect.",
        "signature": "Masoud Deliri"
      },
      "objectives": {
        "title": "Company Objectives",
        "content": "Zhivar Sanat Kian Company operates with the aim of meeting the needs of customers and other stakeholders and increasing their satisfaction level within the framework of its defined policies. This company, as its main goal, focusing on quality, innovation and customer satisfaction, strives to have a superior position in the contracting industry and especially equipment supply. Our goals include providing superior and diverse services, accurate project execution and using international standards and maintaining customer satisfaction and trust. Another of our goals is to create a work environment appropriate to the capabilities and motivation of employees. We value professional development and creating growth opportunities for the company team. Also, by raising their level of expertise and technical knowledge, we try to reach a leadership position in this industry. Another importance that we pay attention to is the continuous improvement of operational processes and optimization of resource use in order to increase efficiency and effectiveness, and by focusing on these goals, we are looking to create a leading company in the contracting industry."
      },
      "policy": {
        "title": "Company Policy",
        "content": "Zhivar Sanat Kian Company, believing in moving in the direction of sustainable development, organizational transformation, moving towards continuous improvement, while paying attention to the requirements of quality management systems, safety, health, environment, accepting economic and social responsibilities, has implemented planned monitoring and controls in its processes and activities and by managing them, has expressed its commitment to continuous improvement in relation to the requirements of the integrated management system including ISO 9001:2015, ISO 14001:2015, ISO 45001:2018 and in order to achieve its goals, has organized the main orientations of the company in the following axes:",
        "points": [
          "Implementation of standards and legal requirements and efforts to meet customer demands",
          "Identification, evaluation and effective control of environmental aspects, occupational safety and health hazards and compliance with related legal requirements",
          "Training, maintaining and developing human capital, gaining employee satisfaction and creating effective participation opportunities in improvement activities",
          "Management, development and updating of organizational processes and activities",
          "Increasing equipment and machinery resources, developing work space and optimal planning and optimal use of resources",
          "Effort to achieve quantitative and qualitative production assignment programs"
        ],
        "footer": "The policy of this company and its determined goals have been communicated to all members of the company and are reviewed at specific time intervals. The management representative in management systems regularly reports the performance and effectiveness of the integrated management system to the CEO. All managers, officials and employees of the company consider themselves committed to active participation in performing duties and complying with the requirements of this system."
      },
      "services": {
        "title": "Company Services",
        "intro": "Zhivar Sanat Kian Company provides a wide range of services at the request of its customers as follows:",
        "list": [
          "Operation services for production lines of industrial and mining factories",
          "Providing all foreign and domestic commercial services, logistics and customs formalities",
          "Production, maintenance, repair, improvement and safety services for factory lines",
          "Supply of consumable parts, production support and implementation of 5S system",
          "Services for supplying and managing required and related human resources for operation",
          "Detailed design, engineering and project management",
          "Engineering, supply and commissioning services for industrial and mining projects",
          "Services for construction of oil, gas and petrochemical product transmission pipelines",
          "Refinery projects and petrochemical facilities and power plant projects",
          "Civil and construction operations",
          "Water transmission pipeline operations",
          "Services for construction of water and gas transmission pipelines and mechanical pipeline operations",
          "Providing technical inspection services and expediting construction",
          "Design of management information systems"
        ]
      }
    }
  },
  "Contact": {
    "title": "Contact Us",
    "default": "Zhivar Sanat Kian | Contact Us",
    "description": "Zhivar Sanat Kian Contact Information"
  },
  "Certifications": {
    "title": "Certifications",
    "default": "Zhivar Sanat Kian | Certifications",
    "description": "Zhivar Sanat Kian Certifications and Awards"
  },
  "Projects": {
    "title": "Projects",
    "default": "Zhivar Sanat Kian | Projects",
    "description": "Zhivar Sanat Kian Projects",
    "project": {
      "title": "Projects | {title}",
      "fallbackTitle": "Zhivar Sanat Kian",
      "description": "Zhivar Sanat Kian - Implementation and operation of industrial and mining projects",
      "fallbackDescription": "Zhivar Sanat Kian - Implementation and operation of industrial and mining projects",
      "projectTitle": "Project Title",
      "employer": "Employer",
      "startDate": "Start Date",
      "projectLocation": "Project Location",
      "projectDescription": "Project Description"
    }
  },
  "Tenders": {
    "title": "Tenders",
    "default": "Zhivar Sanat Kian | Tenders",
    "description": "Zhivar Sanat Kian Tenders",
    "filters": {
      "title": "Advanced Search",
      "fields": {
        "tenderTitle": {
          "label": "Tender Title",
          "placeholder": "Enter title...",
          "error": "Title must be at least 2 characters"
        },
        "category": {
          "label": "Tender Category",
          "options": {
            "all": "All Categories"
          }
        },
        "status": {
          "label": "Tender Status",
          "options": {
            "all": "All Statuses",
            "active": "Active",
            "inactive": "Inactive",
            "cancelled": "Cancelled",
            "renewal": "Renewal"
          }
        }
      },
      "buttons": {
        "clear": "Clear",
        "search": "Search"
      }
    },
    "list": {
      "title": "Tenders List",
      "display": {
        "show": "Show",
        "tenders": "tenders"
      },
      "empty": "No tenders found",
      "error": "Something went wrong. Please try again.",
      "pagination": {
        "page": "Page",
        "of": "of"
      }
    },
    "tenderView": {
      "viewDetails": "View Details",
      "labels": {
        "category": "Category",
        "number": "Number",
        "startDate": "Start Date",
        "endDate": "End Date",
        "status": "Status"
      }
    },
    "tender": {
      "title": "Tenders | {title}",
      "fallbackTitle": "Zhivar Sanat Kian",
      "description": "Zhivar Sanat Kian - Implementation and operation of industrial and mining projects",
      "fallbackDescription": "Zhivar Sanat Kian - Implementation and operation of industrial and mining projects",
      "pageTitle": "Tender Details",
      "table": {
        "tenderTitle": "Tender Title",
        "openingDate": "Documents Opening Date",
        "tenderType": "Tender Type",
        "submissionDeadline": "Documents Submission Deadline",
        "status": "Status",
        "submissionLocation": "Documents Submission Location",
        "tenderNumber": "Tender Number",
        "department": "Department Name",
        "startDate": "Start Date",
        "phone": "Phone",
        "endDate": "End Date",
        "email": "Email",
        "description": "Description"
      },
      "buttons": {
        "download": "Download Tender Documents",
        "print": "Print Tender"
      }
    }
  },
  "Commerce": {
    "title": "Services | Trade and Project Supply Items",
    "default": "Services | Trade and Project Supply Items",
    "description": "Zhivar Sanat Kian, as an international organization, operates in the field of supply and services related to industrial and mining projects, with the aim of providing comprehensive and effective solutions to various industries. By leveraging technical knowledge, a specialized team, and an extensive network of suppliers and business partners worldwide, we meet the needs of our customers with the highest quality and in the shortest possible time.",
    "text": "Zhivar Sanat Kian Company, as an international entity in the field of procurement and services related to industrial and mining projects, operates with the goal of providing comprehensive and effective solutions to various industries. By leveraging technical expertise, a specialized team, and an extensive network of suppliers and business partners worldwide, we meet our clients' needs with the highest quality and in the shortest possible time."
  },
  "Management": {
    "title": "Services | Industrial and Mining Projects Management",
    "default": "Services | Industrial and Mining Projects Management",
    "description": "The expertise of Zhivar Sanat Kian lies in providing comprehensive project management services that help the client complete their projects on time, within the defined scope and budget, and with the desired quality. Our team is committed to delivering high-quality services tailored to the unique needs of the client, especially in EPC (Engineering, Procurement, and Construction) projects.",
    "text": "Zhivar Sanat Kian Company specializes in providing comprehensive project management services, helping clients complete their projects on time, within the defined scope and budget, and at the desired quality. Our team is committed to delivering high-quality services tailored to the unique needs of each client, particularly in EPC (Engineering, Procurement, and Construction) projects."
  },
  "Operation": {
    "title": "Services | Industrial and Mining Projects Operation",
    "default": "Services | Industrial and Mining Projects Operation",
    "description": "Zhivar Sanat Kian's services in the field of operation of industrial projects include two phases: trial operation and commercial operation.",
    "text": "Zhivar Sanat Kian Company's services in the operation of industrial projects include two phases: trial operation and commercial operation, covering the following areas:"
  },
  "CompanyCooperation": {
    "title": "Company Cooperation",
    "default": "Zhivar Sanat Kian | Company Cooperation",
    "description": "Company Collaboration Request Form"
  },
  "Hiring": {
    "title": "Job Opportunities",
    "default": "Zhivar Sanat Kian | Job Opportunities",
    "description": "Zhivar Sanat Kian Job Opportunities",
    "job": {
      "title": "Jobs | {title}",
      "fallbackTitle": "Zhivar Sanat Kian",
      "description": "Zhivar Sanat Kian - Implementation and operation of industrial and mining projects",
      "fallbackDescription": "Zhivar Sanat Kian - Implementation and operation of industrial and mining projects",
      "jobDescription": "Job Description",
      "responsibilities": "Duties and Responsibilities",
      "requirements": "Requirements"
    }
  },
  "ResumeForm": {
    "title": "Couldn't find the job opportunity you were looking for?",
    "subtitle": "Submit your resume. We'll review it when the desired job opportunity becomes available.",
    "fields": {
      "name": {
        "label": "Full Name",
        "required": "Full name is required"
      },
      "birthday": {
        "label": "Date of Birth",
        "required": "Date of birth is required"
      },
      "gender": {
        "label": "Gender",
        "required": "Gender is required",
        "options": {
          "male": "Male",
          "female": "Female"
        }
      },
      "marital": {
        "label": "Marital Status",
        "required": "Marital status is required",
        "options": {
          "single": "Single",
          "married": "Married"
        }
      },
      "military": {
        "label": "Military Service Status",
        "required": "Military service status is required",
        "options": {
          "done": "Completed",
          "exempt": "Exempt",
          "eligible": "Eligible"
        }
      },
      "degree": {
        "label": "Latest Degree",
        "required": "Latest degree is required",
        "options": {
          "below_diploma": "Below Diploma",
          "diploma": "Diploma",
          "associate": "Associate",
          "bachelor": "Bachelor",
          "master": "Master",
          "doctorate": "Doctorate"
        }
      },
      "university": {
        "label": "University",
        "required": "University is required"
      },
      "major": {
        "label": "Field of Study",
        "required": "Field of study is required"
      },
      "experience": {
        "label": "Years of Experience",
        "required": "Years of experience is required",
        "options": {
          "less_than_3": "Less than 3 years",
          "between_3_and_5": "3 to 5 years",
          "greater_than_5": "More than 5 years"
        }
      },
      "email": {
        "label": "Email",
        "required": "Email is required",
        "invalid": "Invalid email address"
      },
      "text": {
        "label": "Additional Information",
        "placeholder": "Enter any additional information here if desired"
      },
      "resume": {
        "label": "Upload Resume",
        "description": "Please upload your resume file. (Maximum size 8MB, PDF format only)",
        "upload": {
          "click": "Click to upload",
          "format": "PDF(MAX. 8MB)"
        },
        "required": "Resume file is required",
        "size_error": "File size should not exceed 8MB",
        "selected": "Selected file: {filename}"
      }
    },
    "submit": {
      "button": "Submit Application",
      "loading": "Submitting",
      "success": "Form submitted successfully",
      "error": "An error occurred. Please try again"
    }
  },
  "Email": {
    "subject": "Resume Received Confirmation",
    "greeting": "Dear",
    "body": "Thank you for submitting your resume. We have received your application and will review it soon.",
    "signature": "Best regards, Hiring Team"
  },
  "JobGrid": {
    "searchPlaceholder": "Search job title",
    "allCities": "All cities",
    "allCategories": "All categories",
    "noJobsFound": "No jobs found.",
    "errorMessage": "Something went wrong. Please try again.",
    "filters": {
      "cities": "Cities",
      "categories": "Categories"
    }
  },
  "CooperationForm": {
    "title": "Company Cooperation Request Form",
    "subtitle": "Please fill out the form carefully. We will contact you as soon as possible.",
    "fields": {
      "companyName": {
        "label": "Company Name *",
        "error": "Company name is required"
      },
      "phone": {
        "label": "Phone Number *",
        "error": "Phone number is required"
      },
      "mobile": {
        "label": "Mobile Number",
        "error": "Must start with 9 and contain 10 digits"
      },
      "address": {
        "label": "Address *",
        "error": "Address is required"
      },
      "cooperationType": {
        "label": "Cooperation Type *",
        "error": "Selecting cooperation type is required",
        "options": {
          "contracting": "Contracting",
          "supplier": "Supplier",
          "engineering_design_services": "Engineering Design Services",
          "investment": "Investment",
          "consulting": "Consulting",
          "other": "Other"
        }
      },
      "file": {
        "label": "Upload File",
        "subtitle": "Please upload your file. (Maximum size 8MB and file format must be PDF)",
        "clickToUpload": "Click to upload",
        "selectedFile": "Selected file:",
        "error": {
          "size": "File size must be less than 8MB",
          "generic": "Error uploading file"
        }
      },
      "description": {
        "label": "Description",
        "placeholder": "Enter additional details here if desired"
      }
    },
    "submit": {
      "button": "Submit Form",
      "loading": "Submitting...",
      "success": "Form submitted successfully",
      "error": "Something went wrong. Please try again."
    }
  },
  "ContactForm": {
    "title": "Stay in touch with us",
    "subtitle": "Send us your comments and suggestions",
    "fields": {
      "name": {
        "placeholder": "Your Name"
      },
      "email": {
        "placeholder": "Email Address (Required)",
        "error": "Invalid email address"
      },
      "website": {
        "placeholder": "Website URL",
        "error": "Invalid website URL"
      },
      "message": {
        "placeholder": "Your Message (Required)",
        "error": "Message must be at least 5 characters"
      }
    },
    "submit": {
      "button": "Send Message",
      "loading": "Sending..."
    },
    "recaptcha": {
      "error": "Please complete the reCAPTCHA"
    },
    "notifications": {
      "recaptchaFailed": "reCAPTCHA verification failed. Please try again.",
      "error": "An error occurred. Please try again.",
      "success": "Form submitted successfully."
    }
  }
}
